#+BEGIN_HTML
---
layout: post
title: Github account fulfilled by clones
tagline: " host all your code there"
permalink: /git/tips/how-to-clone-repository.html
categories: [git, literate programming]
tags: [tutorial, clone, remotes, emacs, babel]
---
#+END_HTML
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t

#+TOC: headlines 2

* Definition
  Nowadays [[https://github.com/][Git]] is a standard option to host your code and share it
  among collaborators. Seems like the best way to introduce it is to
  show how to get a copy of some project on your hard drive for
  further scrutiny, development, tests, adjustments etc.

* Documentation
  The definitive guide how-to do this meta-task is at the official
  Git [[https://git-scm.com/book/en/v2/Git-Basics-Getting-a-Git-Repository#Cloning-an-Existing-Repository][documentation site]].

* Prerequisites
  Of cause you need git installed on your host.
  #+BEGIN_SRC sh :exports both
  git --version
  #+END_SRC

  #+RESULTS:
  : git version 2.9.3

* Cloning itself
** Browse at Github
   seeking something interesting to you and get the link for your
   particular repo like this:
   #+BEGIN_QUOTE
   https://github.com/0--key/org-pub.git
   #+END_QUOTE

** Open terminal tab
   and type:
   #+BEGIN_SRC shell :exports both
   cd /usr/local/share/DVCS/ # it's path for all repositories on my hard drive
   # git clone https://github.com/0--key/org-pub.git
   # uncomment the string above for the actual git clone
   ls org-pub
   #+END_SRC

   #+RESULTS:
   | 2016-08-24-index.org                          |
   | 2016-08-24-intro.org                          |
   | 2016-08-24-intro.org~                         |
   | 2016-08-25-how-to-evaluate.org                |
   | 2016-08-26-disqus.org                         |
   | 2016-08-27-mark-up-samples.org                |
   | 2016-08-27-python-and-sqlite3-interaction.org |
   | 2016-08-30-sqlite3-integrity-check.org        |
   | 2016-08-31-sqlite3-data-types.org             |
   | 2016-09-06-fork-git-repository.org            |
   | 2016-09-06-how-to-clone-git-repo.org          |
   | 2016-09-06-how-to-clone-git-repo.org~         |
   | data_types.db                                 |
   | img                                           |
   | LICENSE                                       |
   | README.md                                     |
   | README.md~                                    |
   | test-sqlite.db                                |

   Seems like repository cloned into org-pub folder and all files are
   inside.

** Check up remotes:
   #+BEGIN_SRC sh :exports both
   cd /usr/local/share/DVCS/org-pub/
   git remote -v
   #+END_SRC

   #+RESULTS:
   | origin | [[https://github.com/0--key/org-pub.git]] (fetch) |
   | origin | [[https://github.com/0--key/org-pub.git]] (push)  |

   Your local version should push and fetch code from a single remote.

* Results
  We got the local version of some interesting repository hosted on
  Git. It allows the arbitrary operations on a personal clone, and, if
  you're previously accepted as a collaborator, even to contribute to
  project.

  It's a usual approach to share access as a collaborator to
  well-known persons. And it is a habitual treatment to organize
  software development among the team members - a team leader creates
  a repository on Github and grants access as a project collaborator
  to them. For security reasons all other persons aside
  from those, whom was formally invited by the project owner, has a
  restricted read-only access to the project's files by default.

  But what about to obtain improvements and corrections from the
  completely unknown developers?

* Conclusion
  It's time to go further and cope with [[http://0--key.github.io/git/tips/how-to-fork-repository.html][Git fork]] technology.
